Revit 2027 API
RevitLinkOptions Constructor
Overload List
Name | Description
RevitLinkOptions(Boolean) |  Creates a RevitLinkOptions object, specifying relative or absolute path type. If the link is workshared, all worksets will be opened.
RevitLinkOptions(RevitLinkOptions) |  Constructs a new copy of the input RevitLinkOptions object.
RevitLinkOptions(Boolean, WorksetConfiguration) |  Creates a RevitLinkOptions object, specifying relative or absolute path type, and the desired workset configuration.
Top
See Also
Reference
RevitLinkOptions Class
Autodesk.Revit.DB Namespace